Analisi Esplorativa dei Dati



Obiettivo: Familiarizzare con le operazioni di base per l'esplorazione dei dati
usando pandas.



Dataset: Utilizzare un dataset di esempio che include le seguenti informazioni su
un gruppo di persone: Nome, Età, Città e Salario. 



Caricare i dati in un DataFrame autogenerandoli casualmente .
Visualizzare le prime e le ultime cinque righe del DataFrame.
Visualizzare il tipo di dati di ciascuna colonna.
Calcolare statistiche descrittive di base per le colonne numeriche (media,
mediana, deviazione standard).
Identificare e rimuovere eventuali duplicati.
Gestire i valori mancanti sostituendoli con la mediana della rispettiva
colonna.
Aggiungere una nuova colonna chiamata "Categoria Età" che classifica le
persone come "Giovane", "Adulto" o "Senior" basandosi sull'età (es., 0-18
anni: Giovane, 19-65 anni: Adulto, oltre 65 anni: Senior).
Salvare il DataFrame pulito in un nuovo file CSV.

In [478]:
import pandas as pd
import numpy as np
import random

In [479]:
colonne = ['Nome','Età','Città','Salario']
len_dati = 1000000

In [480]:
lista_nomi = ['Mario', 'Bubbarello', 'Giuseppe', 'Luigi', 'Giacomo', 'Carlo', 'Andrea']
lista_citta = ['Roma', 'Siena', 'Milano', 'Verona', 'Cosenza', 'Catanzaro', 'San Lucido']
# lista_nomi = ['Mario', 'Bubbarello']
# lista_citta = ['Cosenza', 'Catanzaro']
dati = []
for i in range(len_dati):
    dato = [
        random.choice(lista_nomi),  #Nome
        np.nan  if random.randint(0, 2)==0 else random.randint(16, 22), #Età
        random.choice(lista_citta), #Città
        np.nan  if random.randint(0, 10)==0 else round(random.randint(1000, 1050))   #Salario
        ]
    dati.append(dato)

In [481]:
frame = pd.DataFrame(dati, columns=colonne)

In [482]:
# Prime 5
frame.head()

    Nome   Età    Città  Salario
0  Carlo  16.0   Milano   1007.0
1  Mario  21.0    Siena   1024.0
2  Carlo   NaN     Roma   1015.0
3  Mario  19.0  Cosenza   1035.0
4  Carlo   NaN   Milano   1032.0

In [483]:
# Ultime 5
frame.tail()

          Nome   Età       Città  Salario
999995  Andrea  21.0   Catanzaro   1046.0
999996   Carlo  17.0  San Lucido   1007.0
999997   Carlo  18.0      Verona   1039.0
999998   Luigi  16.0     Cosenza   1013.0
999999   Mario   NaN     Cosenza   1002.0

In [484]:
frame.keys()
for key in frame.keys():
    print(f'Tipo colonna {key} -> {frame[key].dtype}')
    
frame.info()

Tipo colonna Nome -> object
Tipo colonna Età -> float64
Tipo colonna Città -> object
Tipo colonna Salario -> float64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 4 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   Nome     1000000 non-null  object
 1   Età      667179 non-null   float64
 2   Città    1000000 non-null  object
 3   Salario  908335 non-null   float64
dtypes: float64(2), object(2)
memory usage: 30.5+ MB

In [485]:
frame.describe()

                 Età        Salario
count  667179.000000  908335.000000
mean       19.002023    1024.982211
std         2.000422      14.729681
min        16.000000    1000.000000
25%        17.000000    1012.000000
50%        19.000000    1025.000000
75%        21.000000    1038.000000
max        22.000000    1050.000000

In [486]:
frame2 = frame.drop_duplicates()
len(frame2), len(frame)

(20384, 1000000)

In [487]:
frame['Età'].fillna(frame['Età'].mean(), inplace=True)
frame['Salario'].fillna(frame['Età'].mean(), inplace=True)

C:\Users\danie\AppData\Local\Temp\ipykernel_11520\3364226813.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  frame['Età'].fillna(frame['Età'].mean(), inplace=True)
C:\Users\danie\AppData\Local\Temp\ipykernel_11520\3364226813.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  frame['Salario'].fillna(frame['Età'].mean(), inplace=True)

In [488]:
# frame['Categoria Età'] = frame['Età'].apply(lambda x: 'Giovane' if x <= 18 else 'Adulto' if x <= 65 else 'Senior')

frame['Categoria Età'] = ''
frame.loc[frame['Età']<=18, 'Categoria Età'] = 'Giovane'
frame.loc[(frame['Età']>18) & (frame['Età']<=65), 'Categoria Età'] = 'Adulto'
frame.loc[frame['Età']>65, 'Categoria Età'] = 'Senior'

In [489]:
frame

          Nome        Età       Città  Salario Categoria Età
0        Carlo  16.000000      Milano   1007.0       Giovane
1        Mario  21.000000       Siena   1024.0        Adulto
2        Carlo  19.002023        Roma   1015.0        Adulto
3        Mario  19.000000     Cosenza   1035.0        Adulto
4        Carlo  19.002023      Milano   1032.0        Adulto
...        ...        ...         ...      ...           ...
999995  Andrea  21.000000   Catanzaro   1046.0        Adulto
999996   Carlo  17.000000  San Lucido   1007.0       Giovane
999997   Carlo  18.000000      Verona   1039.0       Giovane
999998   Luigi  16.000000     Cosenza   1013.0       Giovane
999999   Mario  19.002023     Cosenza   1002.0        Adulto

[1000000 rows x 5 columns]

In [490]:
frame.to_csv('dati_generati.csv')